EnmanuelParache/msp430fr25x2/msp430fr2522.svd
        <register>
          <name>SYSRSTIV</name>
          <description>Reset Vector Generator</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRSTIV</name>
              <description>Reset interrupt vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOR</name>
                  <description>Brownout</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTNMI</name>
                  <description>RSTIFG RST/NMI</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWBOR</name>
                  <description>PMMSWBOR software BOR</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5WU</name>
                  <description>LPMx.5 wakeup</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECYV</name>
                  <description>Security violation</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_12</name>
                  <description>Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHIFG</name>
                  <description>SVSHIFG SVSH event</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_16</name>
                  <description>Reserved</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_18</name>
                  <description>Reserved</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWPOR</name>
                  <description>PMMSWPOR software POR</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIFG</name>
                  <description>WDTIFG watchdog timeout</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTPW</name>
                  <description>WDTPW watchdog password violation</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCTLPW</name>
                  <description>FRCTLPW password violation</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG</name>
                  <description>Uncorrectable FRAM bit error detection</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERF</name>
                  <description>Peripheral area fetch</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMPW</name>
                  <description>PMM password violation</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_34</name>
                  <description>Reserved</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUL</name>
                  <description>FLL unlock (PUC)</description>
                  <value>36</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG0</name>
          <description>System Configuration Register 0</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PFWP</name>
              <description>Program FRAM write protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFWP_0</name>
                  <description>Program FRAM write enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFWP_1</name>
                  <description>Program FRAM write protected (not writable)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFWP</name>
              <description>Data FRAM write protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFWP_0</name>
                  <description>Data FRAM write enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFWP_1</name>
                  <description>Data FRAM write protected (not writable)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRWPPW</name>
              <description>FRAM protection password, FRAM protection password. Write with 0A5h to unlock the FRAM protection registers. Always reads as 096h</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRWPOA</name>
              <description>Program FRAM write protection offset address from the beginning of Program FRAM. The offset increases by 1KB resolution</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG1</name>
          <description>System Configuration Register 1</description>
          <addressOffset>34</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>IREN</name>
              <description>Infrared enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IREN_0</name>
                  <description>Infrared function disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREN_1</name>
                  <description>Infrared function enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRPSEL</name>
              <description>Infrared polarity select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRPSEL_0</name>
                  <description>Normal polarity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRPSEL_1</name>
                  <description>Inverted polarity</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRMSEL</name>
              <description>Infrared mode select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRMSEL_0</name>
                  <description>FSK mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRMSEL_1</name>
                  <description>ASK mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDSSEL</name>
              <description>Infrared data source select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRDSSEL_0</name>
                  <description>From hardware peripherals upon device configuration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRDSSEL_1</name>
                  <description>From IRDATA bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDATA</name>
              <description>Infrared data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRDATA_0</name>
                  <description>Infrared data logic 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRDATA_1</name>
                  <description>Infrared data logic 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCSEL</name>
              <description>Captivate Conversion triggered Source Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCSEL_0</name>
                  <description>External source is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCSEL_1</name>
                  <description>ADC as the source is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCSEL_2</name>
                  <description>internal source is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCSEL_3</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG2</name>
          <description>System Configuration Register 2</description>
          <addressOffset>36</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCPCTL0</name>
              <description>ADC input A0 pin select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL0_0</name>
                  <description>ADC input A0 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL0_1</name>
                  <description>ADC input A0 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL1</name>
              <description>ADC input A1 pin select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL1_0</name>
                  <description>ADC input A1 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL1_1</name>
                  <description>ADC input A1 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL2</name>
              <description>ADC input A2 pin select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL2_0</name>
                  <description>ADC input A2 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL2_1</name>
                  <description>ADC input A2 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL3</name>
              <description>ADC input A3 pin select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL3_0</name>
                  <description>ADC input A3 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL3_1</name>
                  <description>ADC input A3 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL4</name>
              <description>ADC input A4 pin select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL4_0</name>
                  <description>ADC input A4 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL4_1</name>
                  <description>ADC input A4 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL5</name>
              <description>ADC input A5 pin select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL5_0</name>
                  <description>ADC input A5 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL5_1</name>
                  <description>ADC input A5 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL6</name>
              <description>ADC input A6 pin select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL6_0</name>
                  <description>ADC input A6 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL6_1</name>
                  <description>ADC input A6 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL7</name>
              <description>ADC input A7 pin select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL7_0</name>
                  <description>ADC input A7 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL7_1</name>
                  <description>ADC input A7 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL8</name>
              <description>ADC input A8 pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL8_0</name>
                  <description>ADC input A8 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL8_1</name>
                  <description>ADC input A8 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPCTL9</name>
              <description>ADC input A9 pin select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPCTL9_0</name>
                  <description>ADC input A9 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPCTL9_1</name>
                  <description>ADC input A9 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCIBRMP</name>
              <description>eUSCIB Remapping source selection , please refer to device specific for details</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USCIBRMP_0</name>
                  <description>P1.x is selected, please refer to device specific for details</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USCIBRMP_1</name>
                  <description>other port is selected, please refer to device specific for details</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCCKSEL</name>
              <description>RTC clock selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTC_SMCLK</name>
                  <description>SMCLK is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_ACLK</name>
                  <description>ACLK is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG3</name>
          <description>System Configuration Register 3</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>USCIARMP</name>
              <description>eUSCIA remapping source selection, please refer to device specific for details</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USCIARMP_0</name>
                  <description>P1.x is selected, please refer to device specific for details</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USCIARMP_1</name>
                  <description>other port is selected, please refer to device specific for details</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
