EnmanuelParache/msp430fr25x2/msp430fr2522.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CS</name>
      <description>CS</description>
      <baseAddress>384</baseAddress>
      <registers>
        <register>
          <name>CSCTL0</name>
          <description>Clock System Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DCO</name>
              <description>DCO tap selection. These bits select the DCO tap and are modified automatically during FLL operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD</name>
              <description>Modulation bit counter. These bits select the modulation pattern. All MOD bits are modified automatically during FLL operation. The DCO register value is incremented when the modulation bit counter rolls over from 31 to 0. If the modulation bit counter decrements from 0 to the maximum count, the DCO register value is also decreased.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL1</name>
          <description>Clock System Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>Modulation. This bit enables/disables the modulation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISMOD_0</name>
                  <description>Modulation enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISMOD_1</name>
                  <description>Modulation disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCORSEL</name>
              <description>DCO Range Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCORSEL_0</name>
                  <description>1 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_1</name>
                  <description>2 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_2</name>
                  <description>4 MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_3</name>
                  <description>8 MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_4</name>
                  <description>12 MHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_5</name>
                  <description>16 MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_6</name>
                  <description>20 MHz(Only avaliable in 24MHz clock system)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_7</name>
                  <description>24 MHz(Only avaliable in 24MHz clock system)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOFTRIM</name>
              <description>DCO frequency trim. These bits trims the DCO frequency. By default, it is chipspecific trimmed. These bits can also be trimmed by user code.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOFTRIMEN</name>
              <description>DCO Frequency Trim Enable. When this bit is set, DCOFTRIM value is selected to set DCO frequency. Otherwise, DCOFTRIM value is bypassed and DCO applies default settings in manufacture.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOFTRIMEN_0</name>
                  <description>Disable frequency trim</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIMEN_1</name>
                  <description>Enable frequency trim</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL2</name>
          <description>Clock System Control 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FLLN</name>
              <description>Multiplier bits. These bits set the multiplier value N of the DCO. N must be greater than 0. Writing zero to FLLN causes N to be set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLD</name>
              <description>FLL loop divider. These bits divide f(DCOCLK) in the FLL feedback loop. This results in an additional multiplier for the multiplier bits. See also multiplier bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>fDCOCLK / 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>fDCOCLK / 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>fDCOCLK / 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>fDCOCLK / 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>fDCOCLK / 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>fDCOCLK / 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_6</name>
                  <description>fDCOCLK / 40(Only avaliable in 24MHz clock system)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_7</name>
                  <description>fDCOCLK / 48(Only avaliable in 24MHz clock system)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL3</name>
          <description>Clock System Control 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FLLREFDIV</name>
              <description>FLL reference divider. These bits define the divide factor for f(FLLREFCLK). If XT1 supports high frequency input higher than 32 kHz, the divided frequency is used as the FLL reference frequency. If XT1 only supports 32-kHz clock, FLLREFDIV is always read and written as zero, 000b = fFLLREFCLK / 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>fFLLREFCLK / 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>fFLLREFCLK / 32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>fFLLREFCLK / 64</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>fFLLREFCLK / 128</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>fFLLREFCLK / 256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>fFLLREFCLK / 512</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_6</name>
                  <description>fFLLREFCLK / 640 (only available in 24MHz clock system)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_7</name>
                  <description>fFLLREFCLK / 768(only available in 24MHz clock system)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELREF</name>
              <description>FLL reference select. These bits select the FLL reference clock source.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1CLK</name>
                  <description>XT1CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOCLK</name>
                  <description>REFOCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_2</name>
                  <description>served for future use</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_3</name>
                  <description>served for future use</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFOLP</name>
              <description>REFO Low Power Enable. This bit turns on REFO low-power mode. During switch, the low-power mode will be invalid until REFOREADY is set.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFOLP_0</name>
                  <description>REFO Low Power Disabled (High Power Mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOLP_1</name>
                  <description>REFO Low Power Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL4</name>
          <description>Clock System Control 4</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SELMS</name>
              <description>Selects the MCLK and SMCLK source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOCLKDIV</name>
                  <description>DCOCLKDIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOCLK</name>
                  <description>REFOCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1CLK</name>
                  <description>XT1CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <description>VLOCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_4</name>
                  <description>Reserved for future use</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_5</name>
                  <description>Reserved for future use</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_6</name>
                  <description>Reserved for future use</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_7</name>
                  <description>Reserved for future use</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELA</name>
              <description>Selects the ACLK source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1CLK</name>
                  <description>XT1CLK with divider (must be no more than 40 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOCLK</name>
                  <description>REFO (internal 32-kHz clock source)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <description>VLO (internal 10-kHz clock source)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL5</name>
          <description>Clock System Control 5</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DIVM</name>
              <description>MCLK source divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>/128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVS</name>
              <description>SMCLK source divider. SMCLK directly derives from MCLK. SMCLK frequency is the combination of DIVM and DIVS out of selected clock source.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>/8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMCLKOFF</name>
              <description>SMCLK off. This bit turns off SMCLK clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMCLKOFF_0</name>
                  <description>SMCLK on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLKOFF_1</name>
                  <description>SMCLK off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLOAUTOOFF</name>
              <description>VLO automatic off enable. This bit turns off VLO, if VLO is not used.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VLOAUTOOFF_0</name>
                  <description>VLO always on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOAUTOOFF_1</name>
                  <description>VLO automatically turned off if not used(default)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
