EnmanuelParache/msp430fr25x2/msp430fr2522.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PJ</name>
      <description>PJ</description>
      <baseAddress>800</baseAddress>
      <registers>
        <register>
          <name>PJIN</name>
          <description>Port J Input</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJOUT</name>
          <description>Port J Output</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJDIR</name>
          <description>Port J Direction</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJREN</name>
          <description>Port J Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJSEL0</name>
          <description>Port J Select 0</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJSEL1</name>
          <description>Port J Select 1</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PJSELC</name>
          <description>Port J Complement Select</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TA0</name>
      <description>TA0</description>
      <baseAddress>896</baseAddress>
      <registers>
        <register>
          <name>TA0CTL</name>
          <description>TimerAx Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TAIFG</name>
              <description>TimerA interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAIE</name>
              <description>TimerA interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAIE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIE_1</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACLR</name>
              <description>TimerA clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MC</name>
              <description>Mode control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop mode: Timer is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Up mode: Timer counts up to TAxCCR0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous mode: Timer counts up to 0FFFFh</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDOWN</name>
                  <description>Up/down mode: Timer counts up to TAxCCR0 then down to 0000h</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID</name>
              <description>Input divider</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>/8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TASSEL</name>
              <description>TimerA clock source select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TACLK</name>
                  <description>TAxCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <description>ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <description>SMCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLK</name>
                  <description>INCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TA0CCTL0</name>
          <description>Timer_A Capture/Compare Control Register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COV</name>
              <description>Capture overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COV_0</name>
                  <description>No capture overflow occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COV_1</name>
                  <description>Capture overflow occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Output low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Output high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture/compare input</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIE_1</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>OUT bit value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>Set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>Toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>Set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>Toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>Toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>Reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <description>Compare mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Capture mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCCI</name>
              <description>Synchronized capture/compare input</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCS</name>
              <description>Synchronize capture source</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>Asynchronous capture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>Synchronous capture</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture/compare input select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIA</name>
                  <description>CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIB</name>
                  <description>CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCC</name>
                  <description>VCC</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No capture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Capture on rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Capture on falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Capture on both rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
