EnmanuelParache/msp430fr25x2/msp430fr2522.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BKMEM</name>
      <description>BKMEM</description>
      <baseAddress>1632</baseAddress>
      <registers>
        <register>
          <name>BAKMEM0</name>
          <description>Backup Memory registers. Backup Memory 0.</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM1</name>
          <description>Backup Memory 1.</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM2</name>
          <description>Backup Memory 2.</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM3</name>
          <description>Backup Memory 3.</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM4</name>
          <description>Backup Memory 4.</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM5</name>
          <description>Backup Memory 5.</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM6</name>
          <description>Backup Memory 6.</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM7</name>
          <description>Backup Memory 7.</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM8</name>
          <description>Backup Memory 8.</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM9</name>
          <description>Backup Memory 9.</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM10</name>
          <description>Backup Memory registers. Backup Memory 10.</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM11</name>
          <description>Backup Memory 11.</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM12</name>
          <description>Backup Memory 12.</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM13</name>
          <description>Backup Memory 13.</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM14</name>
          <description>Backup Memory 14.</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM15</name>
          <description>Backup Memory 15.</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>ADC</description>
      <baseAddress>1792</baseAddress>
      <registers>
        <register>
          <name>ADCCTL0</name>
          <description>ADC Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCSC</name>
              <description>start conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSC_0</name>
                  <description>No sample-and-conversion-start</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSC_1</name>
                  <description>Start sample-and-conversion</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCENC</name>
              <description>enable conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCENC_0</name>
                  <description>ADC disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCENC_1</name>
                  <description>ADC enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCON</name>
              <description>ADC on</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCON_0</name>
                  <description>ADC off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCON_1</name>
                  <description>ADC on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCMSC</name>
              <description>sample-and-hold time.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCMSC_0</name>
                  <description>The sampling timer requires a rising edge of the SHI signal to trigger each sample-and-convert.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCMSC_1</name>
                  <description>The incidence of a positive(or for devices first rising edge of the) SHI signal triggers the sampling timer, but further sample-and-conversions are performed automatically as soon as the prior conversion is completed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSHT</name>
              <description>sample-and-hold time.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSHT_0</name>
                  <description>4 ADCCLK cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_1</name>
                  <description>8 ADCCLK cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_2</name>
                  <description>16 ADCCLK cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_3</name>
                  <description>32 ADCCLK cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_4</name>
                  <description>64 ADCCLK cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_5</name>
                  <description>96 ADCCLK cycles</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_6</name>
                  <description>128 ADCCLK cycles</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_7</name>
                  <description>192 ADCCLK cycles</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_8</name>
                  <description>256 ADCCLK cycles</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_9</name>
                  <description>384 ADCCLK cycles</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_10</name>
                  <description>512 ADCCLK cycles</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_11</name>
                  <description>768 ADCCLK cycles</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_12</name>
                  <description>1024 ADCCLK cycles</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_13</name>
                  <description>1024 ADCCLK cycles</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_14</name>
                  <description>1024 ADCCLK cycles</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_15</name>
                  <description>1024 ADCCLK cycles</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCTL1</name>
          <description>ADC Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCBUSY</name>
              <description>ADC busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCBUSY_0</name>
                  <description>No operation is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCBUSY_1</name>
                  <description>A sequence, sample, or conversion is active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCCONSEQ</name>
              <description>conversion sequence mode select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCCONSEQ_0</name>
                  <description>Single-channel, single-conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCCONSEQ_1</name>
                  <description>Sequence-of-channels</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCCONSEQ_2</name>
                  <description>Repeat-single-channel</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCCONSEQ_3</name>
                  <description>Repeat-sequence-of-channels</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSSEL</name>
              <description>clock source select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSSEL_0</name>
                  <description>ADCOSC (MODOSC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSSEL_1</name>
                  <description>ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSSEL_2</name>
                  <description>MCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSSEL_3</name>
                  <description>SMCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCDIV</name>
              <description>clock divider</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCDIV_0</name>
                  <description>/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_1</name>
                  <description>/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_2</name>
                  <description>/3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_3</name>
                  <description>/4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_4</name>
                  <description>/5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_5</name>
                  <description>/6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_6</name>
                  <description>/7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_7</name>
                  <description>/8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCISSH</name>
              <description>invert signal sample-and-hold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCISSH_0</name>
                  <description>The sample-input signal is not inverted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCISSH_1</name>
                  <description>The sample-input signal is inverted.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSHP</name>
              <description>sample-and-hold pulse-mode select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSHP_0</name>
                  <description>SAMPCON signal is sourced from the sample-input signal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHP_1</name>
                  <description>SAMPCON signal is sourced from the sampling timer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSHS</name>
              <description>sample-and-hold source select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSHS_0</name>
                  <description>ADCSC bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHS_1</name>
                  <description>see the device-specific data sheet for source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHS_2</name>
                  <description>see the device-specific data sheet for source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHS_3</name>
                  <description>see the device-specific data sheet for source</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCTL2</name>
          <description>ADC Control 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCDF</name>
              <description>data read-back format</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCDF_0</name>
                  <description>Binary unsigned. Theoretically the analog input voltage V(REF) results in 0000h, the analog input voltage +V(REF) results in 03FFh.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDF_1</name>
                  <description>Signed binary (2s complement), left aligned. Theoretically the analog input voltage V(REF) results in 8000h, the analog input voltage +V(REF) results in 7FC0h.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCRES</name>
              <description>resolution</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCRES_0</name>
                  <description>8 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCRES_1</name>
                  <description>10 bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCRES_2</name>
                  <description>12 bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCRES_3</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSR</name>
              <description>ADC sampling rate.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPDIV</name>
              <description>ADC predivider. This bit predivides the selected ADC clock source before it gets divided again using ADCDIVx.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>Predivide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Predivide by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>Predivide by 64</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPDIV_3</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCLO</name>
          <description>ADC Window Comparator Low Threshold Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADCHI</name>
          <description>ADC Window Comparator High Threshold Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
