EnmanuelParache/msp430fr25x2/msp430fr2522.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65408</baseAddress>
      <interrupt>
        <name>CAPTIVATE</name>
        <description>0xFFE2</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFE4</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFE6</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>0xFFE8</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B0</name>
        <description>0xFFEA</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A0</name>
        <description>0xFFEC</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFEE</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <description>0xFFF0</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A1</name>
        <description>0xFFF2</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A0</name>
        <description>0xFFF4</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A1</name>
        <description>0xFFF6</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A0</name>
        <description>0xFFF8</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>UNMI</name>
        <description>0xFFFA</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>SYSNMI</name>
        <description>0xFFFC</description>
        <value>62</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>